УНФ_ТЕСТ/src/Catalogs/КП_ДополнительныеРеквизиты/КП_ДополнительныеРеквизиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КП_ДополнительныеРеквизиты</name>
  <comment>Используется в видах процессов и видах документов</comment>
  <owners>Catalog.КП_ВидыПроцессов</owners>
  <attributes>
    <name>ТипРеквизита</name>
    <type>
      <types>CatalogRef.КП_СписокМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРеквизитаДляФункций</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВФорме</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВФормеИностранное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обязательный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Системный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОбъектТип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Catalogs/КП_СписокМетаданных/КП_СписокМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КП_СписокМетаданных</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МетаданныеДокументы</name>
      <description>Документы</description>
    </items>
    <items>
      <name>МетаданныеПроцессыИЗадачи</name>
      <description>Процессы и задачи</description>
    </items>
    <items>
      <name>Свойства</name>
      <description>Свойства</description>
    </items>
    <items>
      <name>МетаданныеСправочники</name>
      <description>Справочники</description>
    </items>
    <items>
      <name>Строки</name>
      <description>Строки</description>
    </items>
    <items>
      <name>Числа</name>
      <description>Числа</description>
    </items>
    <items>
      <name>Булево</name>
      <description>Булево</description>
    </items>
    <items>
      <name>Дата</name>
      <description>Дата</description>
    </items>
  </predefined>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДлина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитТочность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвязьСПВХ</name>
    <comment>Связь с ПланомВидовХарактеристик для Свойств</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Catalogs/ЗначенияСвойствОбъектов/ЗначенияСвойствОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗначенияСвойствОбъектов</name>
  <hierarchical>true</hierarchical>
  <owners>ChartOfCharacteristicTypes.ДополнительныеРеквизитыИСведения</owners>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Catalogs/КП_ДополнительныеРеквизиты/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.Наименование="Реквизит процесса 1";
		Объект.НаименованиеВФорме=Объект.Наименование;
		Объект.ИмяРеквизитаДляФункций=ПолучитьИмяИзНаименования(Объект.Наименование);

	Иначе		
		
		Элементы.ЗначениеПоУмолчанию.АктивизироватьПоУмолчанию=Истина;
		Элементы.Наименование.ОтображениеПредупрежденияПриРедактировании=ОтображениеПредупрежденияПриРедактировании.Отображать;
		Элементы.РеквизитПроцесса.ОтображениеПредупрежденияПриРедактировании=ОтображениеПредупрежденияПриРедактировании.Отображать;
		Элементы.НаименованиеВФорме.ОтображениеПредупрежденияПриРедактировании=ОтображениеПредупрежденияПриРедактировании.Отображать;
		
		УстановитьОформлениеЗначенияПоУмолчанию();
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(объект.Владелец) Тогда
		Сообщить("Не указан владелец реквизита. Создание в данном режиме не возможно");
		Отказ=Истина;
		Возврат;
	КонецЕсли;

	УстановитьДоступныйТипЗначения();
	
	//Если Константы.КП_ИспользоватьДваЯзыкаВПрограммноДобавляемыхЭлементахПроцессовИЗадач.Получить() Тогда
	//	Элементы.ДекорацияПробел.Ширина=17;
	//КонецЕсли;
                                     	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	КодПервогоСимвола=КодСимвола(Лев(Объект.Наименование, 1));
	
	Если СимволЭтоЦифра(Лев(Объект.Наименование, 1)) Тогда
		Отказ=Истина;
		ПоказатьПредупреждение(Неопределено, НСтр("en='Name does not begin with a number.';ru='Внимание! Наименование не может начинаться с цифры.'"));
		Возврат;
		
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.ИмяРеквизитаДляФункций) Тогда
		СформироватьИмяРеквизита();
		Если ПустаяСтрока(Объект.ИмяРеквизитаДляФункций) Тогда
			Отказ=Истина;
			ПоказатьПредупреждение(Неопределено, НСтр("en='Name props for functions must not be empty.';ru='Внимание! Имя реквизита для функций не должно быть пустым.'"));
			Возврат;
		
		КонецЕсли;
		
	КонецЕсли;

    Оповестить("РеквизитПроцесса", "Записан", Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьДоступныйТипЗначения()
	
	Если НЕ ЗначениеЗаполнено(Объект.ТипРеквизита) Тогда
		Объект.ЗначениеПоУмолчанию=Неопределено;
		Элементы.ЗначениеПоУмолчанию.ТолькоПросмотр=Истина;
		Возврат;
	КонецЕсли;
	
	Элементы.ЗначениеПоУмолчанию.ТолькоПросмотр=Ложь;
	
	Попытка
		Если Объект.ТипРеквизита.Родитель=Справочники.КП_СписокМетаданных.МетаданныеДокументы Тогда
			НазваниеТипа=Объект.ТипРеквизита.ПолноеНаименование;
			НазваниеТипа=СтрЗаменить(НазваниеТипа, "Документ.", "ДокументСсылка.");
			Элементы.ЗначениеПоУмолчанию.ОграничениеТипа=Новый ОписаниеТипов(НазваниеТипа);
			
		ИначеЕсли Объект.ТипРеквизита.Родитель=Справочники.КП_СписокМетаданных.МетаданныеСправочники Тогда
			НазваниеТипа=Объект.ТипРеквизита.ПолноеНаименование;
			НазваниеТипа=СтрЗаменить(НазваниеТипа, "Справочник.", "СправочникСсылка.");
			
			Элементы.ЗначениеПоУмолчанию.ОграничениеТипа=Новый ОписаниеТипов(НазваниеТипа);
			
		ИначеЕсли Объект.ТипРеквизита.Родитель=Справочники.КП_СписокМетаданных.Числа Тогда
			КвалификаторЧисла=Новый КвалификаторыЧисла(Объект.ТипРеквизита.РеквизитДлина, Объект.ТипРеквизита.РеквизитТочность, ДопустимыйЗнак.Любой);
			Элементы.ЗначениеПоУмолчанию.ОграничениеТипа=Новый ОписаниеТипов(КвалификаторЧисла);
			Если Объект.ЗначениеПоУмолчанию=Неопределено Тогда
				Объект.ЗначениеПоУмолчанию=0;
			КонецЕсли;
			
		ИначеЕсли Объект.ТипРеквизита.Родитель=Справочники.КП_СписокМетаданных.Строки Тогда
			КвалификаторСтроки=Новый КвалификаторыСтроки(Объект.ТипРеквизита.РеквизитДлина);
			Элементы.ЗначениеПоУмолчанию.ОграничениеТипа=Новый ОписаниеТипов(КвалификаторСтроки);
			Если Объект.ЗначениеПоУмолчанию=Неопределено Тогда
				Объект.ЗначениеПоУмолчанию="";
			КонецЕсли;
			
		ИначеЕсли Объект.ТипРеквизита=Справочники.КП_СписокМетаданных.Дата Тогда
			КвалификаторДаты=Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
			Элементы.ЗначениеПоУмолчанию.ОграничениеТипа=Новый ОписаниеТипов(КвалификаторДаты);
			Если Объект.ЗначениеПоУмолчанию=Неопределено Тогда
				Объект.ЗначениеПоУмолчанию=Дата("00010101");
			КонецЕсли;
			
		ИначеЕсли Объект.ТипРеквизита=Справочники.КП_СписокМетаданных.Булево Тогда
			Если Объект.ЗначениеПоУмолчанию=Неопределено Тогда
				Объект.ЗначениеПоУмолчанию=Истина;
			КонецЕсли;

		ИначеЕсли Объект.ТипРеквизита.ПринадлежитЭлементу(Справочники.КП_СписокМетаданных.Свойства) Тогда
			НазваниеТипа="СправочникСсылка.ЗначенияСвойствОбъектов";
	        Элементы.ЗначениеПоУмолчанию.ОграничениеТипа=Новый ОписаниеТипов(НазваниеТипа);
			
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	СформироватьИмяРеквизита();
	
	Объект.НаименованиеВФорме=Объект.Наименование;
		
КонецПроцедуры

&НаКлиенте
Процедура СформироватьИмяРеквизита()
	
	Если СимволЭтоЦифра(Лев(Объект.Наименование, 1)) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("en='Name does not begin with a number.';ru='Внимание! Наименование не может начинаться с цифры.'"));
		Возврат;
		
	КонецЕсли;
	
	Объект.ИмяРеквизитаДляФункций=ПолучитьИмяИзНаименования(Объект.Наименование);	
	
КонецПроцедуры

Функция ПолучитьИмяИзНаименования(Знач ИсходнаяСтрока)
	
	#Если Сервер Тогда
	ИсходнаяСтрока=КП_ОбщееСервер.УдалитьИсключительныеСимволыИзИмени(ИсходнаяСтрока);
	#Иначе
	ИсходнаяСтрока=КП_ОбщееКлиент.УдалитьИсключительныеСимволыИзИмени(ИсходнаяСтрока);
	#КонецЕсли

	КоличествоСимволов=СтрДлина(ИсходнаяСтрока);
	НоваяСтрока="";
	СледующийСимволСБольшой=Ложь;
	
	Для НомерСтроки=1 По КоличествоСимволов Цикл
		СимволСтроки=Сред(ИсходнаяСтрока, НомерСтроки, 1);
		
		Если СимволСтроки=" " Тогда
			СледующийСимволСБольшой=Истина;
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока=НоваяСтрока+?(СледующийСимволСБольшой, ВРег(СимволСтроки), СимволСтроки);
		
		СледующийСимволСБольшой=Ложь;
		
	КонецЦикла;
	
	НоваяСтрока=СтрЗаменить(НоваяСтрока, " ", "");
	
	Возврат НоваяСтрока;
	
КонецФункции

Функция СимволЭтоЦифра(СимволСтроки)
	
	КодСимволаСтроки=КодСимвола(СимволСтроки);
	
	Если КодСимволаСтроки>=48 И КодСимволаСтроки<=57 Тогда
		Возврат Истина;
		
	Иначе
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЭтоРеквизитГруппыСвойств()
	Возврат Объект.ТипРеквизита.ПринадлежитЭлементу(Справочники.КП_СписокМетаданных.Свойства);
КонецФункции

&НаКлиенте
Процедура ЗначениеПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	Если НЕ ЭтоРеквизитГруппыСвойств() Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка=Ложь;
	
	//откроем форму с установленным отбором
	СвязьСПВХ=КП_ОбщееСервер.ПолучитьРеквизитОбъекта(Объект.ТипРеквизита, "СвязьСПВХ");
	ПараметрыОтбора=Новый Структура("Владелец", СвязьСПВХ);	
	ПараметрыФормы=Новый Структура("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	ВыбранноеЗначение = Неопределено;
	
	ОткрытьФорму("Справочник.ЗначенияСвойствОбъектов.ФормаВыбора", ПараметрыФормы,,,,, Новый ОписаниеОповещения("Оповещение_ЗначениеПоУмолчаниюНачалоВыбораЗавершение", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ВыборТипаВнешнегоОбъектаЗавершение(Результат, ИмяЭлемента) Экспорт
	
	ВыбранноеЗначение=Результат;

	Если ВыбранноеЗначение=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ЗначениеПоУмолчанию=ВыбранноеЗначение;
	
	Модифицированность=Истина;

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ЗначениеПоУмолчаниюНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ВыбранноеЗначение=Результат;
    
    Если ВыбранноеЗначение=Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Объект.ЗначениеПоУмолчанию=ВыбранноеЗначение;

КонецПроцедуры

&НаСервере
Функция УстановитьОформлениеЗначенияПоУмолчанию()
	
	Если Объект.ТипРеквизита.РеквизитДлина>80
		И Объект.ТипРеквизита.Родитель=Справочники.КП_СписокМетаданных.Строки 
	Тогда
		Элементы.ЗначениеПоУмолчанию.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
		Элементы.ЗначениеПоУмолчанию.МногострочныйРежим=Истина;
		
	Иначе
		Элементы.ЗначениеПоУмолчанию.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Лево;	
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Попытка
		Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат;
		
	КонецПопытки;
	
	Закрыть(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитПроцессаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	
	ПарамтерыФормы=Новый Структура("РежимВыбора", Истина);
	ОткрытьФорму("Справочник.КП_СписокМетаданных.Форма.ФормаСписка", ПарамтерыФормы,,,,, Новый ОписаниеОповещения("Оповещение_РеквизитПроцессаНачалоВыбораЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_РеквизитПроцессаНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если НЕ ЗначениеЗаполнено(Результат) Тогда
        Возврат;
        
    КонецЕсли;
    
    Объект.ТипРеквизита=Результат;
    
    Объект.ЗначениеПоУмолчанию=Неопределено;
    
    УстановитьДоступныйТипЗначения();
    
    Если Объект.Наименование="Реквизит процесса 1" Тогда
        Объект.Наименование=СокрЛП(Объект.ТипРеквизита)+" 1";
        НаименованиеПриИзменении(Неопределено);
        
    КонецЕсли;
    
    УстановитьОформлениеЗначенияПоУмолчанию();

КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоУмолчаниюАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	//Если ЭтоРеквизитГруппыСвойств() Тогда
	//
	//	Если ПустаяСтрока(Текст) Тогда
	//		Возврат;
	//	КонецЕсли;
	//	
	//	СтандартнаяОбработка=Ложь;
	//	
	//	НайденноеЗначение=КП_ОбщееСервер.ПолучитьЗначениеРеквизитаСвойствПоНаименованию(Объект.Ссылка, Текст); 
	//	
	//	Если ЗначениеЗаполнено(НайденноеЗначение) Тогда
	//		ДанныеВыбора=НайденноеЗначение;
	//		Объект.ЗначениеПоУмолчанию=НайденноеЗначение;     
	//	Иначе
	//		СтандартнаяОбработка=Ложь;

	//	КонецЕсли;
	//Иначе
	//	//любой вызов сервера почему-то сбрасывает текст на текущей версии платформы, пока отремонтируем так
	//	Объект.ЗначениеПоУмолчанию=НЕ ПустаяСтрока(Текст);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоУмолчаниюОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	//любой вызов платформы сбрасывает введенный текст на текущей версии платформы
	
	//Если ЭтоРеквизитГруппыСвойств() Тогда
	//
	//	Если ПустаяСтрока(Текст) Тогда
	//		Возврат;
	//	КонецЕсли;
	//	
	//	НайденноеЗначение=КП_ОбщееСервер.ПолучитьЗначениеРеквизитаСвойствПоНаименованию(Объект.Ссылка, Текст); 
	//	
	//	Если ЗначениеЗаполнено(НайденноеЗначение) Тогда
	//		ДанныеВыбора=НайденноеЗначение;
	//		Объект.ЗначениеПоУмолчанию=НайденноеЗначение;
	//		
	//	Иначе
	//		СтандартнаяОбработка=Ложь;
	//		
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
